name: "centerpose_shoe"
platform: "tensorrt_plan"
max_batch_size: 0
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 1, 3, 512, 512 ]
  }
]
output [
  {
    name: "hm"
    data_type: TYPE_FP32
    dims: [ 1, 1, 128, 128 ]
  },
  {
    name: "wh"
    data_type: TYPE_FP32
    dims: [ 1, 2, 128, 128 ]
  },
  {
    name: "hps"
    data_type: TYPE_FP32
    dims: [ 1, 16, 128, 128 ]
  },
  {
    name: "reg"
    data_type: TYPE_FP32
    dims: [ 1, 2, 128, 128 ]
  },
  {
    name: "hm_hp"
    data_type: TYPE_FP32
    dims: [ 1, 8, 128, 128 ]
  },
  {
    name: "hp_offset"
    data_type: TYPE_FP32
    dims: [ 1, 2, 128, 128 ]
  },
  {
    name: "scale"
    data_type: TYPE_FP32
    dims: [ 1, 3, 128, 128 ]
  }
]
version_policy: {
  specific {
    versions: [ 1 ]
  }
}